#함수!!! 가장중요한 파트!!!
# 함수(function)
"""
1. 함수? 사전적의미는 "기능"

2. 프로그래밍에서의 함수는 일정한 기능을 가진 프로그램의 조각을 말한다

3. 함수를왜 사용하는가?
자주 사용하는 코드를 반복해서 작성하지 않기 위해 사용한다.

우리는 이미 많은 함수를 사용해왔다.
print()
input()
내장함수 : 파이선이 설치될때 자동으로 설치된 함수
사용자정의 함수 : 직접만들어서 사용하는 함수

"""

#2가지 사용자 정의 함수 ,
# 내장함수
print()
input()

#함수 정의 #설계도
def Deco():
    print("--------------------")
    print("------데------------")
    print("--------------------")
    print("---------------코---")
    print("--------------------")
Deco() # 함수의 호출
Deco()
Deco()
Deco()
Deco()
