
# 코드 상단의 작성한 코드의 대한 정보 기술
##################################
# programing name : Comment
# Version : Python 3.6.2
# Data : 2017-09-07
# Name : MSC
##################################

# 프로그래밍에서의 주석이란!
# - 프로그램이 실행될때 , 컴퓨터는 주서으로 처리된부분은 무시합니다
# - 주석은 메모지와 같은 것으로, 적어두면 도움이 될 만한 코드에 대한 설명을 작성합니다.
# - 또는 프로그래밍 실행시 에러가 발생한 소스를 주석처리 해두어
#   에러가 해결된 후 주석을 해제하는 등의 용도로도 사용됩니다.

# 파이썬의 주석 종류 3가지
# 1) 한줄주석  :  #
# 2) 여러줄 주석 1: """ 내용 """ 쌍따옴표
"""
print("여러줄주석")
"""
# 3) 여러줄 주석 2: ''' 내용 ''' 홑따옴표
'''
print("여러줄주석2")

'''
#print(증거)
print("증거")


