"""
if 조건문 :
    #조건이 참일때
    실행할 문장1
else :
    #조건이 거짓일때
    실행할 문장1
"""
#ex1

# score = int(input("점수를 입력하세요 : "))
# if score >= 60:
#     print("합격")
# else :
#     print("불합격")
#
# print("점수는  %d 점입니다" % score)

#문제 1) 중국집 주문을 합니다 메뉴 : 1.쟁반짜장 그외 간짜장 을 주문합니다 를 출력해주세요

# print("*** 홍콩반점 ***\n"
#       "1. 쟁반짜장 : 10000원\n"
#       "2. 간짜장   :  5000\n")
#
# number = int(input("주문할번호를 입력해주세요: "))
# if number == 1:
#     print("쟁반짜장")
# else :
#     print("간짜장")
#
# #문제 2) 정수를 입력받아서 짝수인지 홀수인지 출력해주세요 //힌트 %나머지
# num2 = int(input("정수를 입력하세요 :"))
# if num2 % 2 ==0:
#     print("짝수입니다.")
# else :
#     print("홀수입니다.")

#문제 3) 아이디와 비번을 입력받아서 로그인을 해보세요 // 힌트 and
#id : KoreaIT
#PW : 4321

# id = input("아이디를 입력하세요: ")
# pw = input("패스워드를 입력하세요: ")
#
# if id == "KoreaIT" and pw == "4321":
#     print("로그인")
# else:
#     print("아이디나 패스워드를 다시 확인해주세요")
#

#문제 4) 두정수의 값을 바꿔보세요
a = 20
b = 10

temp = a
a = b
b = temp

print("a와 b:" , a,b)
print("%d와 %d" % (a, b))
print(b)

#문제 5) 중첩 if

"""
성별 을 입력받으세요
나이 를 입력받으세요
성인 , 미성년 , 남 , 여 구분하는 프로그램을 작성해보세요.
"""






